# Exercise 2

In [1]:
import sqlite3

In [2]:
db=sqlite3.connect("G:/Data_Base/sports_database.db")

In [3]:
cur=db.cursor()

In [4]:
cur.execute("Create table Sports(Name text unique ,Id int Primary key ,Country text not null )")

OperationalError: table Sports already exists

In [5]:
cur.execute("insert into sports values('Riaz',101,'Australia'),('John',102,'America'),('Shewag',103,'India')")

IntegrityError: UNIQUE constraint failed: Sports.Id

In [6]:
db.commit()

In [7]:
r=cur.execute("Select * from sports")
r.fetchall()

[('Riaz', 101, 'Australia'),
 ('John', 102, 'America'),
 ('Shewag', 103, 'India')]

# EMPLOYEE DATABASE WITH DB AND python programing:

In [1]:
import sqlite3

In [2]:
db=sqlite3.connect('emp_database.db')

In [3]:
# connection is provided to db and db is connected to def function.

def sql_table(db):
    cur=db.cursor()
    cur.execute("create table emplist(id integer primary key, name text unqiue,salary real, department text, position text, hiredate date )")
    db.commit()

In [4]:
# calling function sql_table

sql_table(db)

In [6]:
cur=db.cursor()
cur.execute("insert into emplist values(1,'Ankit',22000,'Hr','Recruter',2020-06-22)")
db.commit()

In [7]:
result=cur.execute("Select * from emplist")
result.fetchall()

[(1, 'Ankit', 22000.0, 'Hr', 'Recruter', 1992)]

In [22]:
#we can use dinamic values 

def sql_table(db,entities):# in function->adding db,entities means row values
    cur=db.cursor()
    cur.execute("insert into emplist(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)",entities)
    db.commit()

In [13]:
entities=(2,'Andrew',30000,'HR','Manager',2015-4-6)

In [23]:
sql_table(db,entities)

ProgrammingError: Incorrect number of bindings supplied. The current statement uses 6, and there are 2 supplied.

In [15]:
entities=(3,'Pranab',23000,'Finance','Manager',2020-6-9)

In [16]:
sql_table(db,entities)

In [24]:
result=cur.execute("Select * from emplist")
result.fetchall()

[(1, 'Ankit', 22000.0, 'Hr', 'Recruter', 1992),
 (2, 'Andrew', 30000.0, 'HR', 'Manager', 2005),
 (3, 'Pranab', 23000.0, 'Finance', 'Manager', 2005),
 (4, 'Thomas', 34000.0, 'Finance', 'Officer', 1970)]

In [20]:
def sql_insert(db,entities):
    cur=db.cursor()
    cur.execute(" insert into emplist(id,name,salary,department,position,hiredate)values(?,?,?,?,?,?)",entities)
    db.commit()

In [21]:
entities=(4,'Thomas',34000,'Finance','Officer',1997-5-22)

In [23]:
sql_insert(db,entities)

In [25]:
res=cur.execute('Select id,name from Emplist where salary is 22000')
res.fetchall()

[(1, 'Ankit')]

In [27]:
res=cur.execute('Select id,name from Emplist where salary>22000')
res.fetchall()

[(2, 'Andrew'), (3, 'Pranab'), (4, 'Thomas')]

In [28]:
res=cur.execute('Select id,name from Emplist where salary<22000')
res.fetchall()

[]

In [32]:
res=cur.execute('Select name,position from Emplist where id in (1,3,5) ')
res.fetchall()

[('Ankit', 'Recruter'), ('Pranab', 'Manager')]

In [33]:
def sql_insert(db,entities):
    cur=db.cursor()
    cur.execute("insert into emplist(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)",entities)
    db.commit()

In [34]:
entities=(122,'Rajiv',24000,'HR','sr Manager',1998-8-27)

In [35]:
result=cur.execute("Select * from emplist")
result.fetchall()

[(1, 'Ankit', 22000.0, 'Hr', 'Recruter', 1992),
 (2, 'Andrew', 30000.0, 'HR', 'Manager', 2005),
 (3, 'Pranab', 23000.0, 'Finance', 'Manager', 2005),
 (4, 'Thomas', 34000.0, 'Finance', 'Officer', 1970)]

In [36]:
sql_insert(db,entities)

In [37]:
result=cur.execute("Select * from emplist")
result.fetchall()

[(1, 'Ankit', 22000.0, 'Hr', 'Recruter', 1992),
 (2, 'Andrew', 30000.0, 'HR', 'Manager', 2005),
 (3, 'Pranab', 23000.0, 'Finance', 'Manager', 2005),
 (4, 'Thomas', 34000.0, 'Finance', 'Officer', 1970),
 (122, 'Rajiv', 24000.0, 'HR', 'sr Manager', 1963)]

In [42]:
def sql_update(db):
    cur=db.cursor()
    cur.execute("Update emplist set name='Martin' where id is 3 ")
    db.commit()

In [43]:
sql_update(db)

In [44]:
result=cur.execute("Select * from emplist")
result.fetchall()

[(1, 'Ankit', 22000.0, 'Hr', 'Recruter', 1992),
 (2, 'Andrew', 30000.0, 'HR', 'Manager', 2005),
 (3, 'Martin', 23000.0, 'Finance', 'Manager', 2005),
 (4, 'Thomas', 34000.0, 'Finance', 'Officer', 1970),
 (122, 'Rajiv', 24000.0, 'HR', 'sr Manager', 1963)]

In [45]:
def sql_update(db):
    cur=db.cursor()
    cur.execute("Update emplist set id=122 where name is 'Rajiv' ")
    db.commit()

In [46]:
sql_update(db)

In [47]:
result=cur.execute("Select * from emplist")
result.fetchall()

[(1, 'Ankit', 22000.0, 'Hr', 'Recruter', 1992),
 (2, 'Andrew', 30000.0, 'HR', 'Manager', 2005),
 (3, 'Martin', 23000.0, 'Finance', 'Manager', 2005),
 (4, 'Thomas', 34000.0, 'Finance', 'Officer', 1970),
 (122, 'Rajiv', 24000.0, 'HR', 'sr Manager', 1963)]

In [50]:
result=cur.execute("Select min(salary),avg(salary),max(salary) from emplist")
result.fetchall()

[(22000.0, 26600.0, 34000.0)]

In [53]:
r=cur.execute("Select Distinct(department) from emplist")
r.fetchall()

[('Hr',), ('HR',), ('Finance',)]

In [55]:
r=cur.execute("select count(Distinct(department)) from emplist")
r.fetchall()

[(3,)]

In [56]:
r=cur.execute("select count(Distinct(position)) from emplist")
r.fetchall()

[(4,)]

In [60]:
r=cur.execute("select sum(salary),department from emplist group by department")
r.fetchall()

[(57000.0, 'Finance'), (54000.0, 'HR'), (22000.0, 'Hr')]

In [58]:
r=cur.execute("select sum(salary),position from emplist group by position")
r.fetchall()

[(53000.0, 'Manager'),
 (34000.0, 'Officer'),
 (22000.0, 'Recruter'),
 (24000.0, 'sr Manager')]

In [59]:
result=cur.execute("Select * from emplist")
result.fetchall()

[(1, 'Ankit', 22000.0, 'Hr', 'Recruter', 1992),
 (2, 'Andrew', 30000.0, 'HR', 'Manager', 2005),
 (3, 'Martin', 23000.0, 'Finance', 'Manager', 2005),
 (4, 'Thomas', 34000.0, 'Finance', 'Officer', 1970),
 (122, 'Rajiv', 24000.0, 'HR', 'sr Manager', 1963)]

In [72]:
results=cur.execute("Select department,id,name,position,salary from emplist group by Department")
results.fetchall()

[('Finance', 3, 'Martin', 'Manager', 23000.0),
 ('HR', 2, 'Andrew', 'Manager', 30000.0),
 ('Hr', 1, 'Ankit', 'Recruter', 22000.0)]

In [70]:
def sql_query(sql):
    cur=db.cursor()
    result=cur.execute(sql)
    return result

In [75]:
sql="Select * from emplist"

responce=sql_query(sql)
responce.fetchall()

[(1, 'Ankit', 22000.0, 'Hr', 'Recruter', 1992),
 (2, 'Andrew', 30000.0, 'HR', 'Manager', 2005),
 (3, 'Martin', 23000.0, 'Finance', 'Manager', 2005),
 (4, 'Thomas', 34000.0, 'Finance', 'Officer', 1970),
 (10, 'Jack', 32000.0, 'Marketing', 'Feild sales', 1973),
 (122, 'Rajiv', 24000.0, 'HR', 'sr Manager', 1963)]

In [73]:
sql="select name,id from emplist"

r=sql_query(sql)
r.fetchall()

[('Ankit', 1), ('Andrew', 2), ('Martin', 3), ('Thomas', 4), ('Rajiv', 122)]

In [74]:
sql="insert into emplist values(10,'Jack',32000,'Marketing','Feild sales',2007-12-22)"

r=sql_query(sql)
r.fetchall()

[]

In [3]:
cur=db.cursor()

In [12]:
def sql_insert(db,entities):
    cur=db.cursor()
    cur.execute("Insert into emplist(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)",entities)
    db.commit()

In [20]:
entities=[(11,'romio',15000,'IT','Executive','2000-12-22'),(140,'roni',25000,'IT','Executive','2000-12-22')]

In [21]:
sql_insert(db,entities)
db.commit()

ProgrammingError: Incorrect number of bindings supplied. The current statement uses 6, and there are 2 supplied.

In [10]:
result=cur.execute("Select * from emplist")
result.fetchall()

[(1, 'Ankit', 22000.0, 'Hr', 'Recruter', 1992),
 (2, 'Andrew', 30000.0, 'HR', 'Manager', 2005),
 (3, 'Martin', 23000.0, 'Finance', 'Manager', 2005),
 (4, 'Thomas', 34000.0, 'Finance', 'Officer', 1970),
 (122, 'Rajiv', 24000.0, 'HR', 'sr Manager', 1963)]

In [ ]:
# many entities in one.

cur.executemany("Insert into emplist(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)",entities)